
model {
  ssd {
    num_classes: 1
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.7
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 2
        min_scale: -1.2
        max_scale: -0.6
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.3333
	#reduce_boxes_in_lowest_layer: false
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: true
        dropout_keep_probability: 0.6
        kernel_size: 1
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU,
          #regularizer {
          #  l2_regularizer {
          #    weight: 0.00004
          #  }
          #}
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          #batch_norm {
          #  train: true,
          #  scale: true,
          #  center: true,
          #  decay: 0.9997,
          #  epsilon: 0.001,
          #}
        }
      }
    }
    feature_extractor {
      type: 'ssd_mobilenet_v1'
      min_depth: 16
      depth_multiplier: 1.0
      conv_hyperparams {
        activation: RELU,
        #regularizer {
        #  l2_regularizer {
        #    weight: 0.00004
        #  }
        #}
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.9997,
          epsilon: 0.001,
        }
      }
    }
    loss {
      classification_loss {
        #weighted_sigmoid {
        #  anchorwise_output: true
        #}
	weighted_softmax{
	  anchorwise_output: true
	  }
      }
      localization_loss {
        weighted_smooth_l1 {
          anchorwise_output: true
        }
      }
      hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.99
        loss_type: CLASSIFICATION
        max_negatives_per_positive:5
        min_negatives_per_image: 5
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  batch_size: 16
  keep_checkpoint_every_n_hours: 2
  optimizer {
    #rms_prop_optimizer: {
    #  learning_rate: {
    #    exponential_decay_learning_rate {
    #      initial_learning_rate: 0.004
    #      decay_steps: 800720
    #      decay_factor: 0.95
    #    }
    #  }
    #  momentum_optimizer_value: 0.9
    #  decay: 0.9
    #  epsilon: 1.0
    #}
    momentum_optimizer {
      learning_rate {
	exponential_decay_learning_rate {
	  initial_learning_rate: 1e-2
	  decay_steps: 200000
	  decay_factor: 0.1
	}
      }
      momentum_optimizer_value: 0.9
    }
  }
  fine_tune_checkpoint: "model/mobilenet_v1_1.0_224_2017_06_14/mobilenet_v1_1.0_224.ckpt"
  from_detection_checkpoint: false
  num_steps: 600000
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "/media/2TB/Research/DataSet/ILSVRC2015/TFRecord/train.record"
  }
  label_map_path: "/media/2TB/Research/Code/memory_augmented_tracker/data/imagenet_label_map.pbtxt"
}

eval_config: {
  num_examples: 2000
  max_evals: 10
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "/media/2TB/Research/DataSet/ILSVRC2014/val_maxsz500.record"
  }
  label_map_path: "/media/2TB/Research/Code/memory_augmented_tracker/data/imagenet_label_map.pbtxt"
  shuffle: false
  num_readers: 1
}
